---
type: GroupType
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# GroupType

`Autodesk.Revit.DB.GroupType` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAvailableAttachedDetailGroupTypeIds | 2019.1 | `public ISet < ElementId > GetAvailableAttachedDetailGroupTypeIds ()` |
| Method | LoadFrom | 2024 | `public void LoadFrom ( string fileName , GroupLoadOptions options )` |
| Property | Groups | — | `public GroupSet Groups { get ; }` |
| Property | Parameter | — | `` |